{
    "gender": {
        "__PAD__": 0,
        "1.0": 1,
        "2.0": 2,
        "__OOV__": 3
    },
    "age_group": {
        "__PAD__": 0,
        "1.0": 1,
        "2.0": 2,
        "3.0": 3,
        "4.0": 4,
        "5.0": 5,
        "6.0": 6,
        "7.0": 7,
        "8.0": 8,
        "__OOV__": 9
    },
    "inventory_id": {
        "__PAD__": 0,
        "11": 1,
        "19": 2,
        "2": 3,
        "21": 4,
        "29": 5,
        "31": 6,
        "36": 7,
        "37": 8,
        "39": 9,
        "41": 10,
        "42": 11,
        "43": 12,
        "46": 13,
        "8": 14,
        "88": 15,
        "91": 16,
        "92": 17,
        "95": 18,
        "__OOV__": 19
    },
    "day_of_week": {
        "__PAD__": 0,
        "5": 1,
        "__OOV__": 2
    },
    "hour": {
        "__PAD__": 0,
        "00": 1,
        "01": 2,
        "02": 3,
        "03": 4,
        "04": 5,
        "05": 6,
        "06": 7,
        "07": 8,
        "08": 9,
        "09": 10,
        "10": 11,
        "11": 12,
        "12": 13,
        "13": 14,
        "14": 15,
        "15": 16,
        "16": 17,
        "17": 18,
        "18": 19,
        "19": 20,
        "20": 21,
        "21": 22,
        "22": 23,
        "23": 24,
        "__OOV__": 25
    },
    "seq": {
        "__PAD__": 0,
        "1": 1,
        "10": 2,
        "100": 3,
        "101": 4,
        "102": 5,
        "103": 6,
        "104": 7,
        "105": 8,
        "106": 9,
        "108": 10,
        "11": 11,
        "110": 12,
        "113": 13,
        "114": 14,
        "115": 15,
        "116": 16,
        "117": 17,
        "118": 18,
        "119": 19,
        "12": 20,
        "120": 21,
        "121": 22,
        "124": 23,
        "125": 24,
        "126": 25,
        "127": 26,
        "129": 27,
        "13": 28,
        "130": 29,
        "131": 30,
        "132": 31,
        "133": 32,
        "134": 33,
        "135": 34,
        "136": 35,
        "137": 36,
        "138": 37,
        "139": 38,
        "14": 39,
        "140": 40,
        "141": 41,
        "142": 42,
        "144": 43,
        "145": 44,
        "146": 45,
        "147": 46,
        "148": 47,
        "149": 48,
        "15": 49,
        "150": 50,
        "151": 51,
        "152": 52,
        "153": 53,
        "154": 54,
        "155": 55,
        "156": 56,
        "157": 57,
        "158": 58,
        "159": 59,
        "16": 60,
        "160": 61,
        "161": 62,
        "162": 63,
        "163": 64,
        "165": 65,
        "166": 66,
        "167": 67,
        "168": 68,
        "169": 69,
        "17": 70,
        "170": 71,
        "171": 72,
        "172": 73,
        "173": 74,
        "174": 75,
        "175": 76,
        "176": 77,
        "177": 78,
        "178": 79,
        "179": 80,
        "18": 81,
        "180": 82,
        "181": 83,
        "182": 84,
        "183": 85,
        "184": 86,
        "185": 87,
        "186": 88,
        "187": 89,
        "188": 90,
        "189": 91,
        "19": 92,
        "190": 93,
        "191": 94,
        "192": 95,
        "193": 96,
        "194": 97,
        "195": 98,
        "196": 99,
        "197": 100,
        "198": 101,
        "2": 102,
        "20": 103,
        "200": 104,
        "201": 105,
        "202": 106,
        "203": 107,
        "205": 108,
        "206": 109,
        "207": 110,
        "208": 111,
        "209": 112,
        "21": 113,
        "210": 114,
        "212": 115,
        "213": 116,
        "214": 117,
        "215": 118,
        "216": 119,
        "217": 120,
        "218": 121,
        "219": 122,
        "22": 123,
        "221": 124,
        "222": 125,
        "223": 126,
        "224": 127,
        "225": 128,
        "226": 129,
        "227": 130,
        "228": 131,
        "229": 132,
        "23": 133,
        "230": 134,
        "232": 135,
        "233": 136,
        "234": 137,
        "235": 138,
        "236": 139,
        "237": 140,
        "238": 141,
        "239": 142,
        "24": 143,
        "240": 144,
        "242": 145,
        "243": 146,
        "244": 147,
        "245": 148,
        "246": 149,
        "247": 150,
        "248": 151,
        "249": 152,
        "25": 153,
        "250": 154,
        "252": 155,
        "253": 156,
        "254": 157,
        "255": 158,
        "256": 159,
        "257": 160,
        "259": 161,
        "26": 162,
        "260": 163,
        "261": 164,
        "262": 165,
        "263": 166,
        "264": 167,
        "265": 168,
        "266": 169,
        "268": 170,
        "269": 171,
        "27": 172,
        "270": 173,
        "271": 174,
        "272": 175,
        "273": 176,
        "274": 177,
        "275": 178,
        "276": 179,
        "277": 180,
        "279": 181,
        "28": 182,
        "280": 183,
        "281": 184,
        "282": 185,
        "283": 186,
        "285": 187,
        "286": 188,
        "287": 189,
        "289": 190,
        "29": 191,
        "290": 192,
        "291": 193,
        "292": 194,
        "293": 195,
        "294": 196,
        "296": 197,
        "297": 198,
        "298": 199,
        "299": 200,
        "3": 201,
        "30": 202,
        "300": 203,
        "302": 204,
        "303": 205,
        "304": 206,
        "305": 207,
        "306": 208,
        "307": 209,
        "308": 210,
        "309": 211,
        "310": 212,
        "311": 213,
        "312": 214,
        "313": 215,
        "314": 216,
        "315": 217,
        "316": 218,
        "317": 219,
        "318": 220,
        "319": 221,
        "320": 222,
        "321": 223,
        "322": 224,
        "323": 225,
        "324": 226,
        "325": 227,
        "326": 228,
        "328": 229,
        "33": 230,
        "330": 231,
        "331": 232,
        "332": 233,
        "333": 234,
        "334": 235,
        "335": 236,
        "336": 237,
        "337": 238,
        "338": 239,
        "339": 240,
        "34": 241,
        "340": 242,
        "341": 243,
        "342": 244,
        "343": 245,
        "344": 246,
        "345": 247,
        "346": 248,
        "347": 249,
        "348": 250,
        "349": 251,
        "35": 252,
        "350": 253,
        "351": 254,
        "352": 255,
        "353": 256,
        "354": 257,
        "355": 258,
        "356": 259,
        "357": 260,
        "358": 261,
        "36": 262,
        "360": 263,
        "361": 264,
        "362": 265,
        "363": 266,
        "365": 267,
        "366": 268,
        "368": 269,
        "369": 270,
        "37": 271,
        "370": 272,
        "372": 273,
        "373": 274,
        "374": 275,
        "376": 276,
        "377": 277,
        "378": 278,
        "379": 279,
        "38": 280,
        "380": 281,
        "381": 282,
        "382": 283,
        "383": 284,
        "384": 285,
        "386": 286,
        "387": 287,
        "389": 288,
        "39": 289,
        "390": 290,
        "392": 291,
        "393": 292,
        "394": 293,
        "395": 294,
        "396": 295,
        "397": 296,
        "398": 297,
        "399": 298,
        "4": 299,
        "40": 300,
        "400": 301,
        "401": 302,
        "402": 303,
        "403": 304,
        "404": 305,
        "405": 306,
        "406": 307,
        "407": 308,
        "408": 309,
        "41": 310,
        "410": 311,
        "411": 312,
        "413": 313,
        "414": 314,
        "415": 315,
        "416": 316,
        "417": 317,
        "418": 318,
        "419": 319,
        "42": 320,
        "420": 321,
        "421": 322,
        "422": 323,
        "423": 324,
        "424": 325,
        "425": 326,
        "426": 327,
        "427": 328,
        "428": 329,
        "429": 330,
        "43": 331,
        "430": 332,
        "432": 333,
        "433": 334,
        "434": 335,
        "435": 336,
        "436": 337,
        "438": 338,
        "439": 339,
        "44": 340,
        "440": 341,
        "441": 342,
        "442": 343,
        "443": 344,
        "444": 345,
        "445": 346,
        "446": 347,
        "447": 348,
        "449": 349,
        "45": 350,
        "450": 351,
        "451": 352,
        "452": 353,
        "453": 354,
        "455": 355,
        "457": 356,
        "458": 357,
        "459": 358,
        "460": 359,
        "461": 360,
        "462": 361,
        "463": 362,
        "464": 363,
        "465": 364,
        "466": 365,
        "467": 366,
        "468": 367,
        "469": 368,
        "47": 369,
        "470": 370,
        "471": 371,
        "472": 372,
        "473": 373,
        "474": 374,
        "475": 375,
        "476": 376,
        "477": 377,
        "478": 378,
        "479": 379,
        "48": 380,
        "480": 381,
        "481": 382,
        "482": 383,
        "483": 384,
        "484": 385,
        "485": 386,
        "487": 387,
        "488": 388,
        "49": 389,
        "490": 390,
        "491": 391,
        "492": 392,
        "493": 393,
        "494": 394,
        "496": 395,
        "497": 396,
        "498": 397,
        "499": 398,
        "5": 399,
        "50": 400,
        "502": 401,
        "503": 402,
        "504": 403,
        "505": 404,
        "506": 405,
        "507": 406,
        "508": 407,
        "509": 408,
        "51": 409,
        "511": 410,
        "513": 411,
        "514": 412,
        "516": 413,
        "517": 414,
        "519": 415,
        "52": 416,
        "520": 417,
        "521": 418,
        "522": 419,
        "523": 420,
        "524": 421,
        "525": 422,
        "526": 423,
        "527": 424,
        "528": 425,
        "529": 426,
        "53": 427,
        "530": 428,
        "531": 429,
        "532": 430,
        "534": 431,
        "535": 432,
        "536": 433,
        "537": 434,
        "538": 435,
        "539": 436,
        "54": 437,
        "540": 438,
        "541": 439,
        "543": 440,
        "544": 441,
        "545": 442,
        "546": 443,
        "547": 444,
        "548": 445,
        "549": 446,
        "55": 447,
        "550": 448,
        "551": 449,
        "552": 450,
        "554": 451,
        "555": 452,
        "556": 453,
        "559": 454,
        "56": 455,
        "560": 456,
        "561": 457,
        "562": 458,
        "564": 459,
        "565": 460,
        "566": 461,
        "567": 462,
        "568": 463,
        "569": 464,
        "57": 465,
        "570": 466,
        "576": 467,
        "58": 468,
        "582": 469,
        "584": 470,
        "59": 471,
        "6": 472,
        "60": 473,
        "61": 474,
        "62": 475,
        "63": 476,
        "64": 477,
        "65": 478,
        "66": 479,
        "67": 480,
        "68": 481,
        "69": 482,
        "7": 483,
        "70": 484,
        "71": 485,
        "72": 486,
        "73": 487,
        "74": 488,
        "75": 489,
        "76": 490,
        "77": 491,
        "79": 492,
        "8": 493,
        "80": 494,
        "83": 495,
        "84": 496,
        "85": 497,
        "86": 498,
        "87": 499,
        "89": 500,
        "9": 501,
        "90": 502,
        "91": 503,
        "92": 504,
        "93": 505,
        "94": 506,
        "95": 507,
        "97": 508,
        "98": 509,
        "99": 510,
        "__OOV__": 511
    }
}