{
    "gender": {
        "__PAD__": 0,
        "0": 1,
        "1": 2,
        "2": 3,
        "__OOV__": 4
    },
    "age_group": {
        "__PAD__": 0,
        "0": 1,
        "1": 2,
        "2": 3,
        "3": 4,
        "4": 5,
        "5": 6,
        "6": 7,
        "7": 8,
        "8": 9,
        "__OOV__": 10
    },
    "inventory_id": {
        "__PAD__": 0,
        "0": 1,
        "1": 2,
        "10": 3,
        "11": 4,
        "12": 5,
        "13": 6,
        "14": 7,
        "15": 8,
        "16": 9,
        "17": 10,
        "2": 11,
        "4": 12,
        "5": 13,
        "6": 14,
        "7": 15,
        "8": 16,
        "9": 17,
        "__OOV__": 18
    },
    "day_of_week": {
        "__PAD__": 0,
        "0": 1,
        "__OOV__": 2
    },
    "hour": {
        "__PAD__": 0,
        "0": 1,
        "1": 2,
        "10": 3,
        "11": 4,
        "12": 5,
        "13": 6,
        "14": 7,
        "15": 8,
        "16": 9,
        "17": 10,
        "18": 11,
        "19": 12,
        "2": 13,
        "20": 14,
        "21": 15,
        "22": 16,
        "23": 17,
        "3": 18,
        "4": 19,
        "5": 20,
        "6": 21,
        "7": 22,
        "8": 23,
        "9": 24,
        "__OOV__": 25
    },
    "seq_list": {
        "__PAD__": 0,
        "1": 1,
        "100": 2,
        "101": 3,
        "103": 4,
        "104": 5,
        "106": 6,
        "108": 7,
        "11": 8,
        "113": 9,
        "114": 10,
        "115": 11,
        "116": 12,
        "117": 13,
        "118": 14,
        "12": 15,
        "120": 16,
        "121": 17,
        "126": 18,
        "130": 19,
        "132": 20,
        "134": 21,
        "135": 22,
        "136": 23,
        "138": 24,
        "140": 25,
        "144": 26,
        "145": 27,
        "147": 28,
        "149": 29,
        "15": 30,
        "151": 31,
        "152": 32,
        "154": 33,
        "155": 34,
        "156": 35,
        "160": 36,
        "161": 37,
        "165": 38,
        "167": 39,
        "17": 40,
        "171": 41,
        "172": 42,
        "173": 43,
        "174": 44,
        "175": 45,
        "176": 46,
        "177": 47,
        "178": 48,
        "18": 49,
        "184": 50,
        "186": 51,
        "188": 52,
        "189": 53,
        "19": 54,
        "190": 55,
        "193": 56,
        "194": 57,
        "195": 58,
        "198": 59,
        "20": 60,
        "202": 61,
        "203": 62,
        "207": 63,
        "21": 64,
        "212": 65,
        "213": 66,
        "214": 67,
        "215": 68,
        "216": 69,
        "217": 70,
        "218": 71,
        "219": 72,
        "22": 73,
        "221": 74,
        "222": 75,
        "223": 76,
        "224": 77,
        "227": 78,
        "228": 79,
        "230": 80,
        "235": 81,
        "238": 82,
        "239": 83,
        "24": 84,
        "240": 85,
        "242": 86,
        "243": 87,
        "244": 88,
        "245": 89,
        "246": 90,
        "247": 91,
        "248": 92,
        "250": 93,
        "254": 94,
        "256": 95,
        "260": 96,
        "261": 97,
        "263": 98,
        "269": 99,
        "27": 100,
        "272": 101,
        "273": 102,
        "274": 103,
        "275": 104,
        "276": 105,
        "277": 106,
        "279": 107,
        "28": 108,
        "281": 109,
        "282": 110,
        "283": 111,
        "286": 112,
        "290": 113,
        "291": 114,
        "292": 115,
        "296": 116,
        "298": 117,
        "3": 118,
        "300": 119,
        "302": 120,
        "303": 121,
        "304": 122,
        "306": 123,
        "307": 124,
        "308": 125,
        "309": 126,
        "311": 127,
        "312": 128,
        "315": 129,
        "316": 130,
        "317": 131,
        "318": 132,
        "319": 133,
        "321": 134,
        "322": 135,
        "324": 136,
        "326": 137,
        "33": 138,
        "330": 139,
        "331": 140,
        "332": 141,
        "335": 142,
        "337": 143,
        "338": 144,
        "339": 145,
        "34": 146,
        "340": 147,
        "342": 148,
        "343": 149,
        "346": 150,
        "35": 151,
        "350": 152,
        "351": 153,
        "352": 154,
        "353": 155,
        "354": 156,
        "356": 157,
        "36": 158,
        "360": 159,
        "361": 160,
        "363": 161,
        "365": 162,
        "366": 163,
        "369": 164,
        "370": 165,
        "373": 166,
        "374": 167,
        "377": 168,
        "378": 169,
        "380": 170,
        "382": 171,
        "383": 172,
        "384": 173,
        "387": 174,
        "389": 175,
        "39": 176,
        "390": 177,
        "392": 178,
        "395": 179,
        "396": 180,
        "397": 181,
        "399": 182,
        "40": 183,
        "401": 184,
        "403": 185,
        "408": 186,
        "41": 187,
        "410": 188,
        "411": 189,
        "414": 190,
        "415": 191,
        "416": 192,
        "417": 193,
        "420": 194,
        "421": 195,
        "424": 196,
        "425": 197,
        "426": 198,
        "430": 199,
        "432": 200,
        "433": 201,
        "434": 202,
        "436": 203,
        "44": 204,
        "442": 205,
        "443": 206,
        "446": 207,
        "447": 208,
        "449": 209,
        "45": 210,
        "450": 211,
        "451": 212,
        "452": 213,
        "455": 214,
        "457": 215,
        "458": 216,
        "460": 217,
        "463": 218,
        "465": 219,
        "466": 220,
        "469": 221,
        "47": 222,
        "470": 223,
        "471": 224,
        "472": 225,
        "473": 226,
        "474": 227,
        "477": 228,
        "478": 229,
        "479": 230,
        "48": 231,
        "480": 232,
        "481": 233,
        "482": 234,
        "483": 235,
        "484": 236,
        "487": 237,
        "488": 238,
        "49": 239,
        "491": 240,
        "492": 241,
        "497": 242,
        "498": 243,
        "502": 244,
        "503": 245,
        "504": 246,
        "505": 247,
        "506": 248,
        "508": 249,
        "509": 250,
        "51": 251,
        "511": 252,
        "513": 253,
        "516": 254,
        "519": 255,
        "52": 256,
        "520": 257,
        "521": 258,
        "524": 259,
        "525": 260,
        "526": 261,
        "527": 262,
        "528": 263,
        "529": 264,
        "531": 265,
        "532": 266,
        "534": 267,
        "535": 268,
        "536": 269,
        "539": 270,
        "540": 271,
        "541": 272,
        "544": 273,
        "545": 274,
        "547": 275,
        "548": 276,
        "551": 277,
        "554": 278,
        "56": 279,
        "561": 280,
        "566": 281,
        "569": 282,
        "57": 283,
        "570": 284,
        "58": 285,
        "59": 286,
        "62": 287,
        "63": 288,
        "64": 289,
        "65": 290,
        "68": 291,
        "69": 292,
        "71": 293,
        "73": 294,
        "74": 295,
        "75": 296,
        "77": 297,
        "79": 298,
        "8": 299,
        "84": 300,
        "86": 301,
        "9": 302,
        "94": 303,
        "97": 304,
        "98": 305,
        "99": 306,
        "__OOV__": 307
    }
}