{
    "gender": {
        "__PAD__": 0,
        "1.0": 1,
        "2.0": 2,
        "__OOV__": 3
    },
    "age_group": {
        "__PAD__": 0,
        "1.0": 1,
        "2.0": 2,
        "3.0": 3,
        "4.0": 4,
        "5.0": 5,
        "6.0": 6,
        "7.0": 7,
        "8.0": 8,
        "__OOV__": 9
    },
    "inventory_id": {
        "__PAD__": 0,
        "11": 1,
        "19": 2,
        "2": 3,
        "21": 4,
        "29": 5,
        "31": 6,
        "36": 7,
        "37": 8,
        "39": 9,
        "41": 10,
        "42": 11,
        "43": 12,
        "46": 13,
        "8": 14,
        "88": 15,
        "91": 16,
        "92": 17,
        "95": 18,
        "__OOV__": 19
    },
    "day_of_week": {
        "__PAD__": 0,
        "1": 1,
        "4": 2,
        "5": 3,
        "__OOV__": 4
    },
    "hour": {
        "__PAD__": 0,
        "00": 1,
        "01": 2,
        "02": 3,
        "03": 4,
        "04": 5,
        "05": 6,
        "06": 7,
        "07": 8,
        "08": 9,
        "09": 10,
        "10": 11,
        "11": 12,
        "12": 13,
        "13": 14,
        "14": 15,
        "15": 16,
        "16": 17,
        "17": 18,
        "18": 19,
        "19": 20,
        "20": 21,
        "21": 22,
        "22": 23,
        "23": 24,
        "__OOV__": 25
    },
    "seq": {
        "__PAD__": 0,
        "1": 1,
        "10": 2,
        "100": 3,
        "101": 4,
        "102": 5,
        "103": 6,
        "104": 7,
        "105": 8,
        "106": 9,
        "108": 10,
        "109": 11,
        "11": 12,
        "110": 13,
        "111": 14,
        "112": 15,
        "113": 16,
        "114": 17,
        "115": 18,
        "116": 19,
        "117": 20,
        "118": 21,
        "119": 22,
        "12": 23,
        "120": 24,
        "121": 25,
        "124": 26,
        "125": 27,
        "126": 28,
        "127": 29,
        "128": 30,
        "129": 31,
        "13": 32,
        "130": 33,
        "131": 34,
        "132": 35,
        "133": 36,
        "134": 37,
        "135": 38,
        "136": 39,
        "137": 40,
        "138": 41,
        "139": 42,
        "14": 43,
        "140": 44,
        "141": 45,
        "142": 46,
        "144": 47,
        "145": 48,
        "146": 49,
        "147": 50,
        "148": 51,
        "149": 52,
        "15": 53,
        "150": 54,
        "151": 55,
        "152": 56,
        "153": 57,
        "154": 58,
        "155": 59,
        "156": 60,
        "157": 61,
        "158": 62,
        "159": 63,
        "16": 64,
        "160": 65,
        "161": 66,
        "162": 67,
        "163": 68,
        "164": 69,
        "165": 70,
        "166": 71,
        "167": 72,
        "168": 73,
        "169": 74,
        "17": 75,
        "170": 76,
        "171": 77,
        "172": 78,
        "173": 79,
        "174": 80,
        "175": 81,
        "176": 82,
        "177": 83,
        "178": 84,
        "179": 85,
        "18": 86,
        "180": 87,
        "181": 88,
        "182": 89,
        "183": 90,
        "184": 91,
        "185": 92,
        "186": 93,
        "187": 94,
        "188": 95,
        "189": 96,
        "19": 97,
        "190": 98,
        "191": 99,
        "192": 100,
        "193": 101,
        "194": 102,
        "195": 103,
        "196": 104,
        "197": 105,
        "198": 106,
        "199": 107,
        "2": 108,
        "20": 109,
        "200": 110,
        "201": 111,
        "202": 112,
        "203": 113,
        "204": 114,
        "205": 115,
        "206": 116,
        "207": 117,
        "208": 118,
        "209": 119,
        "21": 120,
        "210": 121,
        "212": 122,
        "213": 123,
        "214": 124,
        "215": 125,
        "216": 126,
        "217": 127,
        "218": 128,
        "219": 129,
        "22": 130,
        "220": 131,
        "221": 132,
        "222": 133,
        "223": 134,
        "224": 135,
        "225": 136,
        "226": 137,
        "227": 138,
        "228": 139,
        "229": 140,
        "23": 141,
        "230": 142,
        "232": 143,
        "233": 144,
        "234": 145,
        "235": 146,
        "236": 147,
        "237": 148,
        "238": 149,
        "239": 150,
        "24": 151,
        "240": 152,
        "242": 153,
        "243": 154,
        "244": 155,
        "245": 156,
        "246": 157,
        "247": 158,
        "248": 159,
        "249": 160,
        "25": 161,
        "250": 162,
        "252": 163,
        "253": 164,
        "254": 165,
        "255": 166,
        "256": 167,
        "257": 168,
        "258": 169,
        "259": 170,
        "26": 171,
        "260": 172,
        "261": 173,
        "262": 174,
        "263": 175,
        "264": 176,
        "265": 177,
        "266": 178,
        "267": 179,
        "268": 180,
        "269": 181,
        "27": 182,
        "270": 183,
        "271": 184,
        "272": 185,
        "273": 186,
        "274": 187,
        "275": 188,
        "276": 189,
        "277": 190,
        "278": 191,
        "279": 192,
        "28": 193,
        "280": 194,
        "281": 195,
        "282": 196,
        "283": 197,
        "285": 198,
        "286": 199,
        "287": 200,
        "289": 201,
        "29": 202,
        "290": 203,
        "291": 204,
        "292": 205,
        "293": 206,
        "294": 207,
        "295": 208,
        "296": 209,
        "297": 210,
        "298": 211,
        "299": 212,
        "3": 213,
        "30": 214,
        "300": 215,
        "301": 216,
        "302": 217,
        "303": 218,
        "304": 219,
        "305": 220,
        "306": 221,
        "307": 222,
        "308": 223,
        "309": 224,
        "310": 225,
        "311": 226,
        "312": 227,
        "313": 228,
        "314": 229,
        "315": 230,
        "316": 231,
        "317": 232,
        "318": 233,
        "319": 234,
        "320": 235,
        "321": 236,
        "322": 237,
        "323": 238,
        "324": 239,
        "325": 240,
        "326": 241,
        "327": 242,
        "328": 243,
        "33": 244,
        "330": 245,
        "331": 246,
        "332": 247,
        "333": 248,
        "334": 249,
        "335": 250,
        "336": 251,
        "337": 252,
        "338": 253,
        "339": 254,
        "34": 255,
        "340": 256,
        "341": 257,
        "342": 258,
        "343": 259,
        "344": 260,
        "345": 261,
        "346": 262,
        "347": 263,
        "348": 264,
        "349": 265,
        "35": 266,
        "350": 267,
        "351": 268,
        "352": 269,
        "353": 270,
        "354": 271,
        "355": 272,
        "356": 273,
        "357": 274,
        "358": 275,
        "36": 276,
        "360": 277,
        "361": 278,
        "362": 279,
        "363": 280,
        "365": 281,
        "366": 282,
        "367": 283,
        "368": 284,
        "369": 285,
        "37": 286,
        "370": 287,
        "372": 288,
        "373": 289,
        "374": 290,
        "376": 291,
        "377": 292,
        "378": 293,
        "379": 294,
        "38": 295,
        "380": 296,
        "381": 297,
        "382": 298,
        "383": 299,
        "384": 300,
        "385": 301,
        "386": 302,
        "387": 303,
        "388": 304,
        "389": 305,
        "39": 306,
        "390": 307,
        "391": 308,
        "392": 309,
        "393": 310,
        "394": 311,
        "395": 312,
        "396": 313,
        "397": 314,
        "398": 315,
        "399": 316,
        "4": 317,
        "40": 318,
        "400": 319,
        "401": 320,
        "402": 321,
        "403": 322,
        "404": 323,
        "405": 324,
        "406": 325,
        "407": 326,
        "408": 327,
        "409": 328,
        "41": 329,
        "410": 330,
        "411": 331,
        "413": 332,
        "414": 333,
        "415": 334,
        "416": 335,
        "417": 336,
        "418": 337,
        "419": 338,
        "42": 339,
        "420": 340,
        "421": 341,
        "422": 342,
        "423": 343,
        "424": 344,
        "425": 345,
        "426": 346,
        "427": 347,
        "428": 348,
        "429": 349,
        "43": 350,
        "430": 351,
        "431": 352,
        "432": 353,
        "433": 354,
        "434": 355,
        "435": 356,
        "436": 357,
        "438": 358,
        "439": 359,
        "44": 360,
        "440": 361,
        "441": 362,
        "442": 363,
        "443": 364,
        "444": 365,
        "445": 366,
        "446": 367,
        "447": 368,
        "448": 369,
        "449": 370,
        "45": 371,
        "450": 372,
        "451": 373,
        "452": 374,
        "453": 375,
        "454": 376,
        "455": 377,
        "456": 378,
        "457": 379,
        "458": 380,
        "459": 381,
        "46": 382,
        "460": 383,
        "461": 384,
        "462": 385,
        "463": 386,
        "464": 387,
        "465": 388,
        "466": 389,
        "467": 390,
        "468": 391,
        "469": 392,
        "47": 393,
        "470": 394,
        "471": 395,
        "472": 396,
        "473": 397,
        "474": 398,
        "475": 399,
        "476": 400,
        "477": 401,
        "478": 402,
        "479": 403,
        "48": 404,
        "480": 405,
        "481": 406,
        "482": 407,
        "483": 408,
        "484": 409,
        "485": 410,
        "486": 411,
        "487": 412,
        "488": 413,
        "49": 414,
        "490": 415,
        "491": 416,
        "492": 417,
        "493": 418,
        "494": 419,
        "495": 420,
        "496": 421,
        "497": 422,
        "498": 423,
        "499": 424,
        "5": 425,
        "50": 426,
        "500": 427,
        "502": 428,
        "503": 429,
        "504": 430,
        "505": 431,
        "506": 432,
        "507": 433,
        "508": 434,
        "509": 435,
        "51": 436,
        "511": 437,
        "512": 438,
        "513": 439,
        "514": 440,
        "516": 441,
        "517": 442,
        "518": 443,
        "519": 444,
        "52": 445,
        "520": 446,
        "521": 447,
        "522": 448,
        "523": 449,
        "524": 450,
        "525": 451,
        "526": 452,
        "527": 453,
        "528": 454,
        "529": 455,
        "53": 456,
        "530": 457,
        "531": 458,
        "532": 459,
        "533": 460,
        "534": 461,
        "535": 462,
        "536": 463,
        "537": 464,
        "538": 465,
        "539": 466,
        "54": 467,
        "540": 468,
        "541": 469,
        "542": 470,
        "543": 471,
        "544": 472,
        "545": 473,
        "546": 474,
        "547": 475,
        "548": 476,
        "549": 477,
        "55": 478,
        "550": 479,
        "551": 480,
        "552": 481,
        "554": 482,
        "555": 483,
        "556": 484,
        "558": 485,
        "559": 486,
        "56": 487,
        "560": 488,
        "561": 489,
        "562": 490,
        "563": 491,
        "564": 492,
        "565": 493,
        "566": 494,
        "567": 495,
        "568": 496,
        "569": 497,
        "57": 498,
        "570": 499,
        "576": 500,
        "58": 501,
        "581": 502,
        "582": 503,
        "584": 504,
        "59": 505,
        "6": 506,
        "60": 507,
        "61": 508,
        "62": 509,
        "63": 510,
        "64": 511,
        "65": 512,
        "66": 513,
        "67": 514,
        "68": 515,
        "69": 516,
        "7": 517,
        "70": 518,
        "71": 519,
        "72": 520,
        "73": 521,
        "74": 522,
        "75": 523,
        "76": 524,
        "77": 525,
        "79": 526,
        "8": 527,
        "80": 528,
        "81": 529,
        "82": 530,
        "83": 531,
        "84": 532,
        "85": 533,
        "86": 534,
        "87": 535,
        "88": 536,
        "89": 537,
        "9": 538,
        "90": 539,
        "91": 540,
        "92": 541,
        "93": 542,
        "94": 543,
        "95": 544,
        "97": 545,
        "98": 546,
        "99": 547,
        "__OOV__": 548
    }
}