{
    "gender": {
        "__PAD__": 0,
        "1.0": 1,
        "2.0": 2,
        "__OOV__": 3
    },
    "age_group": {
        "__PAD__": 0,
        "1.0": 1,
        "2.0": 2,
        "3.0": 3,
        "4.0": 4,
        "5.0": 5,
        "6.0": 6,
        "7.0": 7,
        "8.0": 8,
        "__OOV__": 9
    },
    "inventory_id": {
        "__PAD__": 0,
        "11": 1,
        "19": 2,
        "2": 3,
        "21": 4,
        "29": 5,
        "31": 6,
        "36": 7,
        "37": 8,
        "39": 9,
        "41": 10,
        "42": 11,
        "43": 12,
        "46": 13,
        "8": 14,
        "88": 15,
        "91": 16,
        "92": 17,
        "95": 18,
        "__OOV__": 19
    },
    "day_of_week": {
        "__PAD__": 0,
        "5": 1,
        "__OOV__": 2
    },
    "hour": {
        "__PAD__": 0,
        "00": 1,
        "01": 2,
        "02": 3,
        "03": 4,
        "04": 5,
        "05": 6,
        "06": 7,
        "07": 8,
        "08": 9,
        "09": 10,
        "10": 11,
        "11": 12,
        "12": 13,
        "13": 14,
        "14": 15,
        "15": 16,
        "16": 17,
        "17": 18,
        "18": 19,
        "19": 20,
        "20": 21,
        "21": 22,
        "22": 23,
        "23": 24,
        "__OOV__": 25
    },
    "seq": {
        "__PAD__": 0,
        "1": 1,
        "100": 2,
        "101": 3,
        "102": 4,
        "103": 5,
        "104": 6,
        "105": 7,
        "106": 8,
        "108": 9,
        "11": 10,
        "110": 11,
        "113": 12,
        "114": 13,
        "115": 14,
        "116": 15,
        "117": 16,
        "118": 17,
        "12": 18,
        "120": 19,
        "121": 20,
        "124": 21,
        "125": 22,
        "126": 23,
        "127": 24,
        "129": 25,
        "130": 26,
        "131": 27,
        "132": 28,
        "134": 29,
        "135": 30,
        "136": 31,
        "138": 32,
        "139": 33,
        "14": 34,
        "140": 35,
        "141": 36,
        "144": 37,
        "145": 38,
        "146": 39,
        "147": 40,
        "148": 41,
        "149": 42,
        "15": 43,
        "151": 44,
        "152": 45,
        "153": 46,
        "154": 47,
        "155": 48,
        "156": 49,
        "157": 50,
        "16": 51,
        "160": 52,
        "161": 53,
        "163": 54,
        "165": 55,
        "166": 56,
        "167": 57,
        "168": 58,
        "17": 59,
        "171": 60,
        "172": 61,
        "173": 62,
        "174": 63,
        "175": 64,
        "176": 65,
        "177": 66,
        "178": 67,
        "18": 68,
        "181": 69,
        "183": 70,
        "184": 71,
        "185": 72,
        "186": 73,
        "188": 74,
        "189": 75,
        "19": 76,
        "190": 77,
        "193": 78,
        "194": 79,
        "195": 80,
        "196": 81,
        "198": 82,
        "2": 83,
        "20": 84,
        "200": 85,
        "201": 86,
        "202": 87,
        "203": 88,
        "205": 89,
        "206": 90,
        "207": 91,
        "21": 92,
        "212": 93,
        "213": 94,
        "214": 95,
        "215": 96,
        "216": 97,
        "217": 98,
        "218": 99,
        "219": 100,
        "22": 101,
        "221": 102,
        "222": 103,
        "223": 104,
        "224": 105,
        "225": 106,
        "226": 107,
        "227": 108,
        "228": 109,
        "230": 110,
        "235": 111,
        "236": 112,
        "237": 113,
        "238": 114,
        "239": 115,
        "24": 116,
        "240": 117,
        "242": 118,
        "243": 119,
        "244": 120,
        "245": 121,
        "246": 122,
        "247": 123,
        "248": 124,
        "249": 125,
        "25": 126,
        "250": 127,
        "252": 128,
        "253": 129,
        "254": 130,
        "256": 131,
        "257": 132,
        "26": 133,
        "260": 134,
        "261": 135,
        "263": 136,
        "264": 137,
        "265": 138,
        "266": 139,
        "268": 140,
        "269": 141,
        "27": 142,
        "270": 143,
        "271": 144,
        "272": 145,
        "273": 146,
        "274": 147,
        "275": 148,
        "276": 149,
        "277": 150,
        "279": 151,
        "28": 152,
        "281": 153,
        "282": 154,
        "283": 155,
        "285": 156,
        "286": 157,
        "289": 158,
        "290": 159,
        "291": 160,
        "292": 161,
        "293": 162,
        "294": 163,
        "296": 164,
        "298": 165,
        "3": 166,
        "30": 167,
        "300": 168,
        "302": 169,
        "303": 170,
        "304": 171,
        "306": 172,
        "307": 173,
        "308": 174,
        "309": 175,
        "311": 176,
        "312": 177,
        "313": 178,
        "314": 179,
        "315": 180,
        "316": 181,
        "317": 182,
        "318": 183,
        "319": 184,
        "320": 185,
        "321": 186,
        "322": 187,
        "324": 188,
        "326": 189,
        "328": 190,
        "33": 191,
        "330": 192,
        "331": 193,
        "332": 194,
        "333": 195,
        "334": 196,
        "335": 197,
        "337": 198,
        "338": 199,
        "339": 200,
        "34": 201,
        "340": 202,
        "341": 203,
        "342": 204,
        "343": 205,
        "344": 206,
        "345": 207,
        "346": 208,
        "348": 209,
        "349": 210,
        "35": 211,
        "350": 212,
        "351": 213,
        "352": 214,
        "353": 215,
        "354": 216,
        "356": 217,
        "357": 218,
        "358": 219,
        "36": 220,
        "360": 221,
        "361": 222,
        "362": 223,
        "363": 224,
        "365": 225,
        "366": 226,
        "369": 227,
        "37": 228,
        "370": 229,
        "373": 230,
        "374": 231,
        "376": 232,
        "377": 233,
        "378": 234,
        "379": 235,
        "38": 236,
        "380": 237,
        "382": 238,
        "383": 239,
        "384": 240,
        "387": 241,
        "389": 242,
        "39": 243,
        "390": 244,
        "392": 245,
        "393": 246,
        "394": 247,
        "395": 248,
        "396": 249,
        "397": 250,
        "398": 251,
        "399": 252,
        "40": 253,
        "400": 254,
        "401": 255,
        "402": 256,
        "403": 257,
        "404": 258,
        "405": 259,
        "406": 260,
        "407": 261,
        "408": 262,
        "41": 263,
        "410": 264,
        "411": 265,
        "414": 266,
        "415": 267,
        "416": 268,
        "417": 269,
        "418": 270,
        "420": 271,
        "421": 272,
        "422": 273,
        "424": 274,
        "425": 275,
        "426": 276,
        "427": 277,
        "428": 278,
        "430": 279,
        "432": 280,
        "433": 281,
        "434": 282,
        "436": 283,
        "438": 284,
        "439": 285,
        "44": 286,
        "440": 287,
        "441": 288,
        "442": 289,
        "443": 290,
        "444": 291,
        "445": 292,
        "446": 293,
        "447": 294,
        "449": 295,
        "45": 296,
        "450": 297,
        "451": 298,
        "452": 299,
        "453": 300,
        "455": 301,
        "457": 302,
        "458": 303,
        "459": 304,
        "460": 305,
        "461": 306,
        "463": 307,
        "465": 308,
        "466": 309,
        "469": 310,
        "47": 311,
        "470": 312,
        "471": 313,
        "472": 314,
        "473": 315,
        "474": 316,
        "476": 317,
        "477": 318,
        "478": 319,
        "479": 320,
        "48": 321,
        "480": 322,
        "481": 323,
        "482": 324,
        "483": 325,
        "484": 326,
        "487": 327,
        "488": 328,
        "49": 329,
        "491": 330,
        "492": 331,
        "493": 332,
        "494": 333,
        "496": 334,
        "497": 335,
        "498": 336,
        "5": 337,
        "50": 338,
        "502": 339,
        "503": 340,
        "504": 341,
        "505": 342,
        "506": 343,
        "507": 344,
        "508": 345,
        "509": 346,
        "51": 347,
        "511": 348,
        "513": 349,
        "516": 350,
        "517": 351,
        "519": 352,
        "52": 353,
        "520": 354,
        "521": 355,
        "522": 356,
        "524": 357,
        "525": 358,
        "526": 359,
        "527": 360,
        "528": 361,
        "529": 362,
        "53": 363,
        "530": 364,
        "531": 365,
        "532": 366,
        "534": 367,
        "535": 368,
        "536": 369,
        "538": 370,
        "539": 371,
        "54": 372,
        "540": 373,
        "541": 374,
        "543": 375,
        "544": 376,
        "545": 377,
        "546": 378,
        "547": 379,
        "548": 380,
        "55": 381,
        "551": 382,
        "554": 383,
        "56": 384,
        "561": 385,
        "564": 386,
        "565": 387,
        "566": 388,
        "567": 389,
        "568": 390,
        "569": 391,
        "57": 392,
        "570": 393,
        "58": 394,
        "584": 395,
        "59": 396,
        "60": 397,
        "61": 398,
        "62": 399,
        "63": 400,
        "64": 401,
        "65": 402,
        "66": 403,
        "68": 404,
        "69": 405,
        "7": 406,
        "70": 407,
        "71": 408,
        "73": 409,
        "74": 410,
        "75": 411,
        "76": 412,
        "77": 413,
        "79": 414,
        "8": 415,
        "83": 416,
        "84": 417,
        "86": 418,
        "87": 419,
        "9": 420,
        "90": 421,
        "91": 422,
        "92": 423,
        "94": 424,
        "97": 425,
        "98": 426,
        "99": 427,
        "__OOV__": 428
    }
}